In [1]:
import pandas as pd

In [2]:
# if you want to import a function from a python script into your notebooks, carry out this following steps

import os, sys

module_path = os.path.abspath(os.path.join('..'))
if module_path not in sys.path:
    sys.path.append(module_path)
    
from src.helpers import identify_missing_data

In [3]:
# read the users data

users_data = pd.read_pickle("../data/users_data_final.pkl")

In [4]:
type(users_data)

pandas.core.frame.DataFrame

In [5]:
users_data.head()

,user_id,number_transactions,total_amount_usd,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined,device
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,3.0,2143.0,58,management,married,tertiary,False,True,False,None,261,1,-1,0,None,False,1998-08-23,mobile
1,bb92765a-08de-4963-b432-496524b39157,NaN,NaN,44,technician,single,secondary,False,True,False,None,151,1,-1,0,None,False,2008-07-15,desktop
2,573de577-49ef-42b9-83da-d3cfb817b5c1,2.0,2.0,33,entrepreneur,married,secondary,False,True,True,None,76,1,-1,0,None,False,2002-06-04,mobile
3,d6b66b9d-7c8f-4257-a682-e136f640b7e3,NaN,NaN,47,blue-collar,married,None,False,True,False,None,92,1,-1,0,None,False,1995-06-29,tablet
4,fade0b20-7594-4d9a-84cd-c02f79b1b526,1.0,1.0,33,None,single,None,False,False,False,None,198,1,-1,0,None,False,1995-08-01,mobile

In [6]:
users_data.shape

(45209, 19)

In [7]:
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45209 entries, 0 to 45215
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   user_id              45209 non-null  object
 1   number_transactions  35210 non-null  float64
 2   total_amount_usd     35210 non-null  float64
 3   age                  45209 non-null  int64
 4   job                  44921 non-null  object
 5   marital              45209 non-null  object
 6   education            43352 non-null  object
 7   default              45209 non-null  bool
 8   housing              45209 non-null  bool
 9   loan                 45209 non-null  bool
 10  contact              32191 non-null  object
 11  duration             45209 non-null  int64
 12  campaign             45209 non-null  int64
 13  pdays                45209 non-null  int64
 14  previous             45209 non-null  int64
 15  poutcome             8252 non-null   object
 16  term_deposit         45209 non-null  bool
 17  date_joined          45179 non-null  datetime64[ns]
 18  device               45115 non-null  object
dtypes: bool(4), datetime64[ns](1), float64(2), int64(5), object(7)
memory usage: 5.7+ MB

In [8]:
# question: which columns of data have the data type object?

users_data.select_dtypes(['object'])

,user_id,job,marital,education,contact,poutcome,device
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,management,married,tertiary,None,None,mobile
1,bb92765a-08de-4963-b432-496524b39157,technician,single,secondary,None,None,desktop
2,573de577-49ef-42b9-83da-d3cfb817b5c1,entrepreneur,married,secondary,None,None,mobile
3,d6b66b9d-7c8f-4257-a682-e136f640b7e3,blue-collar,married,None,None,None,tablet
4,fade0b20-7594-4d9a-84cd-c02f79b1b526,None,single,None,None,None,mobile
...,...,...,...,...,...,...,...
45211,a218c1d6-880a-4431-a314-a1bd3dc36b21,technician,married,tertiary,cellular,None,desktop
45212,6a6bf402-9416-4e71-97c6-727e8298a3a5,retired,divorced,primary,cellular,None,desktop
45213,be32ba96-b178-4b54-b32a-f75b714793df,retired,married,secondary,cellular,success,mobile
45214,44623a48-4e9b-48fd-b155-a17d1c06a754,blue-collar,married,secondary,telephone,None,desktop
45215,5905741c-3f30-416f-8ee5-71abad035de6,entrepreneur,married,secondary,cellular,other,mobile

In [9]:
# this is a list that contains all the columns with data type object

cols_name = list(users_data.select_dtypes(['object']).columns)
cols_name

['user_id', 'job', 'marital', 'education', 'contact', 'poutcome', 'device']

In [10]:
# how many variables have the data type object
len(cols_name)

7

In [11]:
print("# of columns with data type object:", len(cols_name))

# of columns with data type object: 7

In [12]:
# question: how many columns of data have the data type numerical i.e. float, int, bool?

numerical_cols = list(users_data.select_dtypes(['int64', 'float64', 'bool']).columns)
numerical_cols

['number_transactions',
 'total_amount_usd',
 'age',
 'default',
 'housing',
 'loan',
 'duration',
 'campaign',
 'pdays',
 'previous',
 'term_deposit']

In [13]:
print("# of columns with numerical data types (int, float, bool):", len(numerical_cols))

# of columns with numerical data types (int, float, bool): 11

In [14]:
# question: how many columns of data have the data type object or datetime

non_numerical_cols = list(users_data.select_dtypes(['object', 'datetime64[ns]']).columns)
non_numerical_cols

['user_id',
 'job',
 'marital',
 'education',
 'contact',
 'poutcome',
 'date_joined',
 'device']

In [15]:
print("# of columns with non numerical data types (datetime, object):", len(non_numerical_cols))

# of columns with non numerical data types (datetime, object): 8

In [16]:
# question: how many rows of data are duplicated?

users_data[users_data.duplicated()]

Empty DataFrame
Columns: [user_id, number_transactions, total_amount_usd, age, job, marital, education, default, housing, loan, contact, duration, campaign, pdays, previous, poutcome, term_deposit, date_joined, device]
Index: []

In [17]:
users_data.duplicated().sum()

0

In [18]:
print("# of rows with duplicated data:", users_data.duplicated().sum())

# of rows with duplicated data: 0

In [19]:
# missing data

users_data.isnull().sum()

user_id                    0
number_transactions     9999
total_amount_usd        9999
age                        0
job                      288
marital                    0
education               1857
default                    0
housing                    0
loan                       0
contact                13018
duration                   0
campaign                   0
pdays                      0
previous                   0
poutcome               36957
term_deposit               0
date_joined               30
device                    94
dtype: int64

In [20]:
users_data.isnull().mean()

user_id                0.000000
number_transactions    0.221173
total_amount_usd       0.221173
age                    0.000000
job                    0.006370
marital                0.000000
education              0.041076
default                0.000000
housing                0.000000
loan                   0.000000
contact                0.287952
duration               0.000000
campaign               0.000000
pdays                  0.000000
previous               0.000000
poutcome               0.817470
term_deposit           0.000000
date_joined            0.000664
device                 0.002079
dtype: float64

In [21]:
missing_df = identify_missing_data(users_data)
missing_df

              variable  percent_missing       data_type
0             poutcome            81.75          object
1              contact            28.80          object
2     total_amount_usd            22.12         float64
3  number_transactions            22.12         float64
4            education             4.11          object
5                  job             0.64          object
6               device             0.21          object
7          date_joined             0.07  datetime64[ns]

In [22]:
type(missing_df)

pandas.core.frame.DataFrame

In [23]:
missing_df.shape[0]

8

In [24]:
len(list(missing_df.variable))

8

In [25]:
# question: how many columns contain missing data

missing_df.shape[0]

8

In [26]:
# option 1 
print("The number of columns with missing data:", missing_df.shape[0])

The number of columns with missing data: 8

In [27]:
# option 2 
print("The number of columns with missing data:", len(missing_df.variable))

The number of columns with missing data: 8

In [28]:
# question: how many columns with data type object contain missing data?

missing_df[missing_df.data_type == 'object']

    variable  percent_missing data_type
0   poutcome            81.75    object
1    contact            28.80    object
4  education             4.11    object
5        job             0.64    object
6     device             0.21    object

In [29]:
missing_df[missing_df.data_type == 'object'].shape[0]

5

In [30]:
len(missing_df[missing_df.data_type == 'object'].variable)

5

In [31]:
# option 1 
print("The number of columns with data type object and missing data:", missing_df[missing_df.data_type == 'object'].shape[0])

The number of columns with data type object and missing data: 5

In [32]:
# option 2
print("The number of columns with data type object and missing data:", len(missing_df[missing_df.data_type == 'object'].variable))

The number of columns with data type object and missing data: 5

In [33]:
# question: how columns with data type float64 or int64 contain missing data?

# option 1 - but may not work for everyone, is using isin
missing_df[missing_df.data_type.isin(['int64', 'float64'])]

              variable  percent_missing data_type
2     total_amount_usd            22.12   float64
3  number_transactions            22.12   float64

In [34]:
# option 2, using a pipe operator which means or in python

missing_df[(missing_df.data_type == "float64") | (missing_df.data_type == "int64")]

              variable  percent_missing data_type
2     total_amount_usd            22.12   float64
3  number_transactions            22.12   float64

In [35]:
missing_df[missing_df.data_type.isin(['int64', 'float64'])].shape[0]

2

In [36]:
len(missing_df[missing_df.data_type.isin(['int64', 'float64'])].variable)

2

In [37]:
# option 1
print("The number of columns with data type integer or float",  missing_df[missing_df.data_type.isin(['int64', 'float64'])].shape[0])

The number of columns with data type integer or float 2

In [38]:
print("The number of columns with data type integer or float", 
      missing_df[(missing_df.data_type == "float64") | (missing_df.data_type == "int64")].shape[0])

The number of columns with data type integer or float 2

In [39]:
# option 2
print("The number of columns with data type integer or float",  len(missing_df[missing_df.data_type.isin(['int64', 'float64'])].variable))

The number of columns with data type integer or float 2

In [40]:
# question: how many columns of data contain more than 70% missing data?
missing_df

              variable  percent_missing       data_type
0             poutcome            81.75          object
1              contact            28.80          object
2     total_amount_usd            22.12         float64
3  number_transactions            22.12         float64
4            education             4.11          object
5                  job             0.64          object
6               device             0.21          object
7          date_joined             0.07  datetime64[ns]

In [41]:
missing_df[missing_df.percent_missing > 70]

   variable  percent_missing data_type
0  poutcome            81.75    object

In [42]:
print("The number of columns with more than 70% missing data", missing_df[missing_df.percent_missing > 70].shape[0])

The number of columns with more than 70% missing data 1

In [43]:
print("The number of columns with more than 70% missing data", len(missing_df[missing_df.percent_missing > 70].variable))

The number of columns with more than 70% missing data 1

In [50]:
# showing off..
threshold = 70 # the % of missing data you want to identify
print(f"The number of columns with more than {threshold}% missing data: {missing_df[missing_df.percent_missing > threshold].shape[0]}")

The number of columns with more than 70% missing data: 1

In [45]:
# removing all columns that have more than 70% missing data

# demoing where pouctome is not null
users_data[~users_data.poutcome.isnull()]

,user_id,number_transactions,total_amount_usd,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined,device
24062,94a34d67-057a-434e-bdf6-7c2c1ec6b784,4.0,882.0,33,admin.,married,tertiary,False,False,False,telephone,39,1,151,3,failure,False,1989-09-27,mobile
24064,2e3874ed-6f1a-47ba-91d0-dca08eb75d08,19.0,-247.0,42,admin.,single,secondary,False,True,True,telephone,519,1,166,1,other,True,1997-07-29,mobile
24066,6e3ca3da-6cc7-43be-b1d7-c82151a37bb2,2.0,3444.0,33,services,married,secondary,False,True,False,telephone,144,1,91,4,failure,True,2006-05-31,desktop
24074,9367f782-e526-420b-ac44-57da34d6958e,3.0,2415.0,36,management,married,tertiary,False,True,False,telephone,73,1,86,4,other,False,2005-02-15,mobile
24079,aa8bdce2-875b-489b-b50c-f2f7cf78816f,10.0,0.0,36,management,married,tertiary,False,True,False,telephone,140,1,143,3,failure,True,2001-07-06,desktop
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45204,4e89ea4b-c518-426a-bac1-2927f5813cd4,4.0,1475.0,34,blue-collar,single,secondary,False,True,False,cellular,1166,3,530,12,other,False,2009-04-12,mobile
45206,2c85f77c-9c4d-4e05-a296-9c3a32bd097e,3.0,583.0,53,management,married,tertiary,False,False,False,cellular,226,1,184,4,success,True,1990-12-25,mobile
45209,fe7442ae-7e90-498e-afd3-1cbdb494448f,2.0,2850.0,73,retired,married,secondary,False,False,False,cellular,300,1,40,8,failure,True,2003-06-01,mobile
45213,be32ba96-b178-4b54-b32a-f75b714793df,2.0,5715.0,72,retired,married,secondary,False,False,False,cellular,1127,5,184,3,success,True,1996-06-18,mobile
45215,5905741c-3f30-416f-8ee5-71abad035de6,3.0,2971.0,37,entrepreneur,married,secondary,False,False,False,cellular,361,2,188,11,other,False,1994-04-28,mobile

In [46]:
# identify all the columns that contain more than 70% missing data
missing_df = identify_missing_data(users_data)
cols_to_drop = list(missing_df[missing_df.percent_missing > 70].variable)
cols_to_drop

['poutcome']

In [47]:
# passing a list into the drop function
users_data_transformed = users_data.drop(cols_to_drop, axis=1)

In [48]:
identify_missing_data(users_data_transformed)

              variable  percent_missing       data_type
0              contact            28.80          object
1     total_amount_usd            22.12         float64
2  number_transactions            22.12         float64
3            education             4.11          object
4                  job             0.64          object
5               device             0.21          object
6          date_joined             0.07  datetime64[ns]